In [4]:
import pandas as pd
from pandas import DataFrame, Series
import numpy as np

### Series

In [9]:
obj = pd.Series([4, 7, -5, 3],index=['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj[['a','b']]

a   -5
b    7
dtype: int64

In [15]:
obj[obj>3] *5

d    20
b    35
dtype: int64

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [26]:
obj3.name = 'population'
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [19]:
type(obj3)

pandas.core.series.Series

In [21]:
dic = obj3.to_dict()
dic

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [22]:
type(dic)

dict

### DataFrame

In [51]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'population': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data,columns=['year', 'state', 'population','debt'])
frame

   year   state  population debt
0  2000    Ohio         1.5  NaN
1  2001    Ohio         1.7  NaN
2  2002    Ohio         3.6  NaN
3  2001  Nevada         2.4  NaN
4  2002  Nevada         2.9  NaN

In [52]:
frame.columns

Index(['year', 'state', 'population', 'debt'], dtype='object')

In [53]:
frame['population']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: population, dtype: float64

In [54]:
frame.population

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: population, dtype: float64

In [55]:
frame.loc[1]

year          2001
state         Ohio
population     1.7
debt           NaN
Name: 1, dtype: object

In [56]:
frame.debt = np.arange(5.)
frame

   year   state  population  debt
0  2000    Ohio         1.5   0.0
1  2001    Ohio         1.7   1.0
2  2002    Ohio         3.6   2.0
3  2001  Nevada         2.4   3.0
4  2002  Nevada         2.9   4.0

In [57]:
del frame['debt']
frame

   year   state  population
0  2000    Ohio         1.5
1  2001    Ohio         1.7
2  2002    Ohio         3.6
3  2001  Nevada         2.4
4  2002  Nevada         2.9

In [61]:
frame.to_numpy()

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9]], dtype=object)

In [64]:
df = pd.Series(np.arange(5.0), index=['a', 'b', 'c', 'd', 'e'])
df

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [76]:
label = np.arange(5)
ff = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
ff

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [77]:
f = ff.reindex(['a', 'b', 'c', 'd', 'ee'])
f

a     0.0
b     1.0
c     2.0
d     3.0
ee    NaN
dtype: float64

In [78]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [80]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [81]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                         index=["Ohio", "Colorado", "Utah", "New York"],
                          columns=["one", "two", "three", "four"])

In [82]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [87]:
data.loc[:,'two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [90]:
data.iat[1,3]

7

In [91]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [93]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [95]:
p = s2 + s1
p

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [97]:
df = pd.DataFrame(np.arange(15.).reshape((3, 5)), columns=list("ABCDE"))
df

      A     B     C     D     E
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0

In [112]:
df.loc[1, "B"] = 80
df

      A     B     C     D     E
0   0.0   1.0   2.0   3.0   4.0
1   5.0  80.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0

In [120]:
df.describe()

          A          B     C     D     E
count   3.0   3.000000   3.0   3.0   3.0
mean    5.0  30.666667   7.0   8.0   9.0
std     5.0  43.015501   5.0   5.0   5.0
min     0.0   1.000000   2.0   3.0   4.0
25%     2.5   6.000000   4.5   5.5   6.5
50%     5.0  11.000000   7.0   8.0   9.0
75%     7.5  45.500000   9.5  10.5  11.5
max    10.0  80.000000  12.0  13.0  14.0

In [113]:
df.sum(axis=0,skipna=False)

A    15.0
B    92.0
C    21.0
D    24.0
E    27.0
dtype: float64

In [114]:
df.mean(axis = 1, skipna = False)

0     2.0
1    21.8
2    12.0
dtype: float64

In [116]:
df.idxmin()

A    0
B    0
C    0
D    0
E    0
dtype: int64

In [133]:
df.corr()

          A         B         C         D         E
A  1.000000  0.116237  1.000000  1.000000  1.000000
B  0.116237  1.000000  0.116237  0.116237  0.116237
C  1.000000  0.116237  1.000000  1.000000  1.000000
D  1.000000  0.116237  1.000000  1.000000  1.000000
E  1.000000  0.116237  1.000000  1.000000  1.000000

In [136]:
df.value_counts()

A     B     C     D     E
0.0   1.0   2.0   3.0   4.0     1
5.0   80.0  7.0   8.0   9.0     1
10.0  11.0  12.0  13.0  14.0    1
Name: count, dtype: int64

In [2]:
import os
import subprocess

# Define the target directory and file URL
directory = "../examples"
file_url = "https://github.com/wesm/pydata-book/blob/3rd-edition/examples/ex1.csv"

# Check if the directory exists
if not os.path.exists(directory):
    # If the directory does not exist, create it
    os.makedirs(directory)
    print(f"Directory '{directory}' created.")

# Use wget to download the file into the specified directory
try:
    subprocess.run(["wget", "-P", directory, file_url], check=True)
    print("File downloaded successfully.")
except subprocess.CalledProcessError as e:
    print(f"Failed to download the file: {e}")

Directory '../examples' created.

--2024-09-21 14:56:13--  https://github.com/wesm/pydata-book/blob/3rd-edition/examples/ex1.csv
Resolving github.com (github.com)... 140.82.121.4
Connecting to github.com (github.com)|140.82.121.4|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/html]
Saving to: ‘../examples/ex1.csv’

     0K .......... .......... .......... .......... ..........  102K
    50K .......... .......... .......... ..

File downloaded successfully.

........ ..........  222K
   100K .......... .......... .......... .......... ..........  719K
   150K .......... ........                                    10.4M=0.8s

2024-09-21 14:56:15 (213 KB/s) - ‘../examples/ex1.csv’ saved [172188]

In [5]:
df = pd.read_csv("../examples/ex1.csv")

ParserError: Error tokenizing data. C error: Expected 1 fields in line 41, saw 30

^C

In [12]:
d =pd.Series([1, np.nan, 3.5, np.nan, 7])
d

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
d.dropna(how='all')

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna(how = 'all')  # drop rows that all values are NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data[4] =  np.nan# drop rows that any values are NaN
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [38]:
data.loc[3,4] = 10
data

     0    1    2     4
0  1.0  6.5  3.0   NaN
1  1.0  NaN  NaN   NaN
2  NaN  NaN  NaN   NaN
3  NaN  6.5  3.0  10.0

In [37]:
data.bfill()  # fill NaN with 0.5 in column 1 and 0 in column 2

     0    1    2     4
0  1.0  6.5  3.0  10.0
1  1.0  6.5  3.0  10.0
2  NaN  6.5  3.0  10.0
3  NaN  6.5  3.0  10.0

In [40]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})  
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated() # check if the row is duplicated

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates(subset=['k2','k1'],keep='last') # drop duplicated rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4